cracked-machine/DigitalCurrentSinkV3/SW/STM32L496_DigitalCurrentSinkV3/Src/InputManager.c
/*
 * inputmanager.c
 *
 *  Created on: Aug 6, 2019
 *      Author: Chris Sutton
 *
 *      State-machine functions:
 *
 *      IM_ReadKeyCol0()		- 	state transitions for keypad btns 1,4,7,*
 *      IM_ReadKeyCol1()		- 	state transitions for keypad btns 2,5,8,0
 *      IM_ReadKeyCol2()		- 	state transitions for keypad btns 3,6,9,#
 *      IM_MenuEXTIHandler()	- 	state transitions for tactile btns 1-4
 *
 *      _Concatenate() manages keypad buffer and resolves digit/decimal positioning
 *
 *      Note, _SetKeypadBuffer() also applies the settings via call to DU_SetVoltagePreview()/DU_SetFreqPreview()
 */

// HAL dependencies
#include <DacUtilities.h>
#include <DisplayManager.h>
#include <InputManager.h>
#include "stm32l4xx_hal.h"
#include "tim.h"

// project dependencies
#include "ssd1306.h"

// C LIB
#include <string.h>
#include <stdarg.h>
#include <math.h>

/* Sequence of rows to enable/disable for MUX.
 * Used by IM_MuxKeysRows() */
enum
{
	PIN1_ON,
	PIN1_OFF,
	PIN2_ON,
	PIN2_OFF,
	PIN3_ON,
	PIN3_OFF,
	PIN4_ON,
	PIN4_OFF

};

/* counter used by TIM17 (TIM1_TRG_COM_TIM17_IRQHandler) to traverse the keypad rows */
int keypad_row_mux_count=0;

/* counter to track when user presses "decimal point" keypad button
 * along with any subsequent digits pressed thereafter.  */
uint8_t decimal_point_count = 0;

/* size of number to be drawn. Used by DisplayManager   */
uint8_t digit_length = 0;

/* Keypad debounce variables. Increase min_keypad_bounce_delay to decrease bouncing */
uint32_t keypad_debounce_counter = 0;
uint32_t last_keypad_delay = 0;
uint32_t min_keypad_bounce_delay = 250;

/* Buffers last four digits pressed by user. See _Concatenate() */
float keypad_buffer = 0;

/* Buffer limit. See _Concatenate() */
uint32_t keypadBufferMax = 5001;

// private function declarations
void _ApplyParameterSettings();
uint32_t _GetKeypadDebounceCounter();
void _SetKeypadBuffer(double pValue);
void _ClearKeypadBuffer();
double _Concatenate(double _buffer, double _newDigit);


/**
  * @brief Get digit_length variable
  *
  *
  * @param
  * 		@arg @ref
  * @param
  * 		@arg @ref
  *
  *
  * @retval digit_length
  */

uint8_t IM_GetDigitLength()
{
	return decimal_point_count;
}

/**
  * @brief Set keypad_debounce_counter variable
  *
  *
  * @param
  * 		@arg @ref
  * @param
  * 		@arg @ref
  *
  *
  * @retval
  */

void IM_SetKeypadDebounceCounter(uint16_t pValue)
{
	keypad_debounce_counter += pValue;
}


/**
  * @brief	Set current row (keypad_row_mux_count) to logic high or low
  *			keypad_row_mux_count is incremented by Timer17
  *
  * @retval none
  */

void IM_MuxKeysRows()
{
	switch(keypad_row_mux_count)
	{
	case PIN1_ON:
		HAL_GPIO_WritePin(GPIOE, KP1_GPOUT_Pin, GPIO_PIN_SET);
		keypad_row_mux_count++;
		break;
	case PIN1_OFF:
		HAL_GPIO_WritePin(GPIOE, KP1_GPOUT_Pin, GPIO_PIN_RESET);
		keypad_row_mux_count++;
		break;
	case PIN2_ON:
		HAL_GPIO_WritePin(GPIOE, KP2_GPOUT_Pin, GPIO_PIN_SET);
		keypad_row_mux_count++;
		break;
	case PIN2_OFF:
		HAL_GPIO_WritePin(GPIOE, KP2_GPOUT_Pin, GPIO_PIN_RESET);
		keypad_row_mux_count++;
		break;
	case PIN3_ON:
		HAL_GPIO_WritePin(GPIOE, KP3_GPOUT_Pin, GPIO_PIN_SET);
		keypad_row_mux_count++;
		break;
	case PIN3_OFF:
		HAL_GPIO_WritePin(GPIOE, KP3_GPOUT_Pin, GPIO_PIN_RESET);
		keypad_row_mux_count++;
		break;
	case PIN4_ON:
		HAL_GPIO_WritePin(GPIOE, KP4_GPOUT_Pin, GPIO_PIN_SET);
		keypad_row_mux_count++;
		break;
	case PIN4_OFF:
		HAL_GPIO_WritePin(GPIOE, KP4_GPOUT_Pin, GPIO_PIN_RESET);
		keypad_row_mux_count=0;
		break;
	}
}

/**
  * @brief	Check if any buttons on this column read logic high
  *
  * @retval	none
  */

void IM_ReadKeyCol0()
{
	uint32_t new_keypad_delay = _GetKeypadDebounceCounter();
	if(new_keypad_delay - last_keypad_delay > min_keypad_bounce_delay)
	{
		displayState_t mode = DM_GetState();
		// BUTTON 1
		if(HAL_GPIO_ReadPin(GPIOE, KP1_GPOUT_Pin))
		{
			switch(mode)
			{
				case PROGSEL_DISP:
					if(DU_IsDualChannelMode())
					{
						DU_SetDACModePreview(DAC_CHANNEL_1, DAC_USER);
						DU_SetDACModePreview(DAC_CHANNEL_2, DAC_USER);
					}
					else
					{
						DU_SetDACModePreview(DU_GetActiveDACChannel(), DAC_USER);
					}
					decimal_point_count=0;		// show no decimal place by default in DAC_USER mode
					DM_SetBlinkTimer(1);
					DM_ChangeScreen(PARAMS_DISP);
					break;
				case PARAMS_DISP:
					_SetKeypadBuffer(_Concatenate(keypad_buffer, 1));
					break;
				case HOME_DISP:
					DU_SetActiveDACChannel(DAC_CHANNEL_1);
					DU_ToggleDualChannelMode(0);
					break;
				case CHANSEL_DISP:
					break;
				case AMPLITUDE_DISP:
					if(DU_IsDualChannelMode())
					{
						if(DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO)
						{
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_1, DAC_TRIANGLEAMPLITUDE_7);
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_2, DAC_TRIANGLEAMPLITUDE_7);

						}
						else
						{
							DU_SetRandAmplitudeSetting(DAC_CHANNEL_1, DAC_LFSRUNMASK_BITS2_0);
							DU_SetRandAmplitudeSetting(DAC_CHANNEL_2, DAC_LFSRUNMASK_BITS2_0);
						}
					}
					else
					{
						if((DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO) || (DU_GetDACModePreview(DAC_CHANNEL_2) == DAC_AUTO))
							DU_SetRampAmplitudeSetting(DU_GetActiveDACChannel(), DAC_TRIANGLEAMPLITUDE_7);
						else
							DU_SetRandAmplitudeSetting(DU_GetActiveDACChannel(), DAC_LFSRUNMASK_BITS2_0);
					}
					break;
				default:
					break;
			}

			printf("Key1 Pressed = %2.2f\n", keypad_buffer);
		}

		// BUTTON 4
		if(HAL_GPIO_ReadPin(GPIOE, KP2_GPOUT_Pin))
		{
			switch(mode)
			{
				case PARAMS_DISP:
					_SetKeypadBuffer(_Concatenate(keypad_buffer, 4));
					break;
				case AMPLITUDE_DISP:
					if(DU_IsDualChannelMode())
					{
						if(DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO)
						{
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_1, DAC_TRIANGLEAMPLITUDE_63);
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_2, DAC_TRIANGLEAMPLITUDE_63);

						}
						else
						{
							DU_SetRandAmplitudeSetting(DAC_CHANNEL_1, DAC_LFSRUNMASK_BITS5_0);
							DU_SetRandAmplitudeSetting(DAC_CHANNEL_2, DAC_LFSRUNMASK_BITS5_0);
						}


