cracked-machine/DigitalCurrentSinkV3/SW/STM32L496_DigitalCurrentSinkV3/Src/InputManager.c
					}
					else
					{
						if((DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO) || (DU_GetDACModePreview(DAC_CHANNEL_2) == DAC_AUTO))
						{
							DU_SetRampAmplitudeSetting(DU_GetActiveDACChannel(), DAC_TRIANGLEAMPLITUDE_63);
						}
						else
						{
							DU_SetRandAmplitudeSetting(DU_GetActiveDACChannel(), DAC_LFSRUNMASK_BITS5_0);
						}

					}
					break;
				case HOME_DISP:
					DM_SetUnitMode(SHOWCURR);
					break;
				case PROGSEL_DISP:
				case CHANSEL_DISP:
				default:
					break;
			}

			printf("Key4 Pressed = %2.2f\n", keypad_buffer);
		}

		// BUTTON 7
		if(HAL_GPIO_ReadPin(GPIOE, KP3_GPOUT_Pin))
		{
			switch(mode)
			{
				case PARAMS_DISP:
					_SetKeypadBuffer(_Concatenate(keypad_buffer, 7));
					break;
				case AMPLITUDE_DISP:
					if(DU_IsDualChannelMode())
					{
						if(DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO)
						{
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_1, DAC_TRIANGLEAMPLITUDE_511);
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_2, DAC_TRIANGLEAMPLITUDE_511);
							// 5A is too high for the heatsink
							//DU_SetRampAmplitudeSetting(DAC_CHANNEL_1, DAC_TRIANGLEAMPLITUDE_1023);
							//DU_SetRampAmplitudeSetting(DAC_CHANNEL_2, DAC_TRIANGLEAMPLITUDE_1023);
						}
						else
						{
							// 5A is too high for the heatsink
							//DU_SetRandAmplitudeSetting(DAC_CHANNEL_1, DAC_LFSRUNMASK_BITS9_0);
							//DU_SetRandAmplitudeSetting(DAC_CHANNEL_2, DAC_LFSRUNMASK_BITS9_0);
						}


					}
					else
					{
						if((DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO) || (DU_GetDACModePreview(DAC_CHANNEL_2) == DAC_AUTO))
						{
							DU_SetRampAmplitudeSetting(DU_GetActiveDACChannel(), DAC_TRIANGLEAMPLITUDE_511);
						}
						else
						{
							// 5A is too high for the heatsink
							//DU_SetRandAmplitudeSetting(DU_GetActiveDACChannel(), DAC_LFSRUNMASK_BITS9_0);
						}

					}
					break;
				case PROGSEL_DISP:
				case CHANSEL_DISP:
				case HOME_DISP:
				default:
					break;
			}

			printf("Key7 Pressed = %2.2f\n", keypad_buffer);
		}

		// BUTTON *
		if(HAL_GPIO_ReadPin(GPIOE, KP4_GPOUT_Pin))
		{
			switch(mode)
			{
				case PARAMS_DISP:
					// enable decimal point count (incremented further by other digit presses)
					if(!decimal_point_count)
					{
						printf("Enabled DP Count\n");
						decimal_point_count=1;
					}
					break;
				case HOME_DISP:
					DU_ClearVoltagePreview(DAC_CHANNEL_1);
					DU_SetVoltage(DAC_CHANNEL_1);
					DU_ClearFreqPreview(DAC_CHANNEL_1);
					DU_SetFreq(DAC_CHANNEL_1);
					DU_SetDACModeActual(DAC_CHANNEL_1,DAC_USER);

					break;
				case PROGSEL_DISP:
				case CHANSEL_DISP:
				default:
					break;
			}

			printf("Key * Pressed = %2.2f\n", keypad_buffer);
		}

		last_keypad_delay = new_keypad_delay;
	}

}

/**
  * @brief	Check if any buttons on this column read logic high
  *
  * @retval	none
  */

void IM_ReadKeyCol1()
{
	uint32_t new_keypad_delay = _GetKeypadDebounceCounter();
	if(new_keypad_delay - last_keypad_delay > min_keypad_bounce_delay)
	{
		displayState_t mode = DM_GetState();
		// BUTTON 2
		if(HAL_GPIO_ReadPin(GPIOE, KP1_GPOUT_Pin))
		{
			switch(mode)
			{
				case PROGSEL_DISP:
					if(DU_IsDualChannelMode())
					{
						DU_SetDACModePreview(DAC_CHANNEL_1, DAC_AUTO);
						DU_SetDACModePreview(DAC_CHANNEL_2, DAC_AUTO);
					}
					else
					{
						DU_SetDACModePreview(DU_GetActiveDACChannel(), DAC_AUTO);
					}

					DM_SetBlinkTimer(1);
					//decimal_point_count=1;			// show .0f by default in DAC_AUTO mode
					DM_ChangeScreen(PARAMS_DISP);
					break;
				case PARAMS_DISP:
					_SetKeypadBuffer(_Concatenate(keypad_buffer, 2));
					break;
				case HOME_DISP:
					DU_SetActiveDACChannel(DAC_CHANNEL_2);
					DU_ToggleDualChannelMode(0);
					break;
				case AMPLITUDE_DISP:
					if(DU_IsDualChannelMode())
					{
						if(DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO)
						{
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_1, DAC_TRIANGLEAMPLITUDE_15);
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_2, DAC_TRIANGLEAMPLITUDE_15);
						}
						else
						{
							DU_SetRandAmplitudeSetting(DAC_CHANNEL_1, DAC_LFSRUNMASK_BITS3_0);
							DU_SetRandAmplitudeSetting(DAC_CHANNEL_2, DAC_LFSRUNMASK_BITS3_0);
						}


					}
					else
					{
						if((DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO) || (DU_GetDACModePreview(DAC_CHANNEL_2) == DAC_AUTO))
						{
							DU_SetRampAmplitudeSetting(DU_GetActiveDACChannel(), DAC_TRIANGLEAMPLITUDE_15);
						}
						else
						{
							DU_SetRandAmplitudeSetting(DU_GetActiveDACChannel(), DAC_LFSRUNMASK_BITS3_0);
						}

					}
					break;
				case CHANSEL_DISP:
				default:
					break;
			}

			printf("Key2 Pressed = %2.2f\n", keypad_buffer);
		}

		// BUTTON 5
		if(HAL_GPIO_ReadPin(GPIOE, KP2_GPOUT_Pin))
		{
			switch(mode)
			{
				case PARAMS_DISP:
					_SetKeypadBuffer(_Concatenate(keypad_buffer, 5));
					break;
				case AMPLITUDE_DISP:
					if(DU_IsDualChannelMode())
					{
						if(DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO)
						{
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_1, DAC_TRIANGLEAMPLITUDE_127);
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_2, DAC_TRIANGLEAMPLITUDE_127);
						}
						else
						{
							DU_SetRandAmplitudeSetting(DAC_CHANNEL_1, DAC_LFSRUNMASK_BITS6_0);
							DU_SetRandAmplitudeSetting(DAC_CHANNEL_2, DAC_LFSRUNMASK_BITS6_0);
						}
					}
					else
					{
						if((DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO) || (DU_GetDACModePreview(DAC_CHANNEL_2) == DAC_AUTO))
						{
							DU_SetRampAmplitudeSetting(DU_GetActiveDACChannel(), DAC_TRIANGLEAMPLITUDE_127);
						}
						else
						{
							DU_SetRandAmplitudeSetting(DU_GetActiveDACChannel(), DAC_LFSRUNMASK_BITS6_0);
						}

					}
					break;
				case HOME_DISP:
					DM_SetUnitMode(SHOWVOLT);
					break;
				case PROGSEL_DISP:
				case CHANSEL_DISP:

				default:
					break;
			}
			printf("Key5 Pressed = %2.2f\n", keypad_buffer);
		}

		// BUTTON 8
		if(HAL_GPIO_ReadPin(GPIOE, KP3_GPOUT_Pin))
		{
			switch(mode)
			{
				case PARAMS_DISP:
					_SetKeypadBuffer(_Concatenate(keypad_buffer, 8));
					break;
				case AMPLITUDE_DISP:
					if(DU_IsDualChannelMode())
					{
						if(DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO)
						{
							// 10A is too high for the heatsink
							//DU_SetRampAmplitudeSetting(DAC_CHANNEL_1, DAC_TRIANGLEAMPLITUDE_2047);
							//DU_SetRampAmplitudeSetting(DAC_CHANNEL_2, DAC_TRIANGLEAMPLITUDE_2047);
						}
						else
						{
							// 10A is too high for the heatsink
							//DU_SetRandAmplitudeSetting(DAC_CHANNEL_1, DAC_LFSRUNMASK_BITS10_0);
							//DU_SetRandAmplitudeSetting(DAC_CHANNEL_2, DAC_LFSRUNMASK_BITS10_0);
						}
					}
					else
					{
						if((DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO) || (DU_GetDACModePreview(DAC_CHANNEL_2) == DAC_AUTO))
						{
							// 10A is too high for the heatsink
							//DU_SetRampAmplitudeSetting(DU_GetActiveDACChannel(), DAC_TRIANGLEAMPLITUDE_2047);
						}
						else
						{
							// 10A is too high for the heatsink
							//DU_SetRandAmplitudeSetting(DU_GetActiveDACChannel(), DAC_LFSRUNMASK_BITS10_0);
						}

