cracked-machine/DigitalCurrentSinkV3/SW/STM32L496_DigitalCurrentSinkV3/Src/InputManager.c
					}
					break;
				case PROGSEL_DISP:
				case CHANSEL_DISP:
				case HOME_DISP:
				default:
					break;
			}
			printf("Key8 Pressed = %2.2f\n", keypad_buffer);
		}

		// BUTTON 0
		if(HAL_GPIO_ReadPin(GPIOE, KP4_GPOUT_Pin))
		{
			switch(mode)
			{
				case PARAMS_DISP:
					_SetKeypadBuffer(_Concatenate(keypad_buffer, 0));
					break;
				case AMPLITUDE_DISP:
					if(DU_IsDualChannelMode())
					{
						if(DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO)
						{

						}
						else
						{
							//DU_SetRandAmplitudeSetting(DAC_CHANNEL_1, DAC_LFSRUNMASK_BITS2_0);
							//DU_SetRandAmplitudeSetting(DAC_CHANNEL_2, DAC_LFSRUNMASK_BITS2_0);
						}


					}
					else
					{
						if((DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO) || (DU_GetDACModePreview(DAC_CHANNEL_2) == DAC_AUTO))
						{
							DU_SetRampAmplitudeSetting(DU_GetActiveDACChannel(), DAC_TRIANGLEAMPLITUDE_7);
						}
						else
						{
							//DU_SetRandAmplitudeSetting(DU_GetActiveDACChannel(), DAC_LFSRUNMASK_BITS2_0);
						}

					}
					break;
				case PROGSEL_DISP:
				case CHANSEL_DISP:
				case HOME_DISP:
				default:
					break;
			}
			printf("Key0 Pressed = %2.2f\n", keypad_buffer);
		}

		last_keypad_delay = new_keypad_delay;
	}

}

/**
  * @brief	Check if any buttons on this column read logic high
  *
  * @retval	none
  */

void IM_ReadKeyCol2()
{
	uint32_t new_keypad_delay = _GetKeypadDebounceCounter();
	if(new_keypad_delay - last_keypad_delay > min_keypad_bounce_delay)
	{
		displayState_t mode = DM_GetState();
		// BUTTON 3
		if(HAL_GPIO_ReadPin(GPIOE, KP1_GPOUT_Pin))
		{

			switch(mode)
			{
				case PROGSEL_DISP:
					if(DU_IsDualChannelMode())
					{
						DU_SetDACModePreview(DAC_CHANNEL_1, DAC_RAND);
						DU_SetDACModePreview(DAC_CHANNEL_2, DAC_RAND);
					}
					else
					{
						DU_SetDACModePreview(DU_GetActiveDACChannel(), DAC_RAND);
					}
					//decimal_point_count=1;		// show .0f by default in DAC_RAND mode
					DM_SetBlinkTimer(1);
					DM_ChangeScreen(PARAMS_DISP);
					break;
				case PARAMS_DISP:
					_SetKeypadBuffer(_Concatenate(keypad_buffer, 3));
					break;
				case HOME_DISP:
					DU_ToggleDualChannelMode(1);
					break;
				case AMPLITUDE_DISP:
					if(DU_IsDualChannelMode())
					{
						if(DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO)
						{
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_1, DAC_TRIANGLEAMPLITUDE_31);
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_2, DAC_TRIANGLEAMPLITUDE_31);
						}
						else
						{
							DU_SetRandAmplitudeSetting(DAC_CHANNEL_1, DAC_LFSRUNMASK_BITS4_0);
							DU_SetRandAmplitudeSetting(DAC_CHANNEL_2, DAC_LFSRUNMASK_BITS4_0);
						}

					}
					else
					{
						if((DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO) || (DU_GetDACModePreview(DAC_CHANNEL_2) == DAC_AUTO))
						{
							DU_SetRampAmplitudeSetting(DU_GetActiveDACChannel(), DAC_TRIANGLEAMPLITUDE_31);
						}
						else
						{
							DU_SetRandAmplitudeSetting(DU_GetActiveDACChannel(), DAC_LFSRUNMASK_BITS4_0);
						}

					}
					break;
				case CHANSEL_DISP:
				default:
					break;
			}
			printf("Key3 Pressed = %2.2f\n", keypad_buffer);

		}

		// BUTTON 6
		if(HAL_GPIO_ReadPin(GPIOE, KP2_GPOUT_Pin))
		{
			switch(mode)
			{
				case PARAMS_DISP:
					_SetKeypadBuffer(_Concatenate(keypad_buffer, 6));
					break;
				case AMPLITUDE_DISP:
					if(DU_IsDualChannelMode())
					{
						if(DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO)
						{
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_1, DAC_TRIANGLEAMPLITUDE_255);
							DU_SetRampAmplitudeSetting(DAC_CHANNEL_2, DAC_TRIANGLEAMPLITUDE_255);
						}
						else
						{
							DU_SetRandAmplitudeSetting(DAC_CHANNEL_1, DAC_LFSRUNMASK_BITS7_0);
							DU_SetRandAmplitudeSetting(DAC_CHANNEL_2, DAC_LFSRUNMASK_BITS7_0);
						}


					}
					else
					{
						if((DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO) || (DU_GetDACModePreview(DAC_CHANNEL_2) == DAC_AUTO))
						{
							DU_SetRampAmplitudeSetting(DU_GetActiveDACChannel(), DAC_TRIANGLEAMPLITUDE_255);
						}
						else
						{
							DU_SetRandAmplitudeSetting(DU_GetActiveDACChannel(), DAC_LFSRUNMASK_BITS7_0);
						}

					}
					break;
				case HOME_DISP:
					DM_SetUnitMode(SHOWBITS);
					break;
				case PROGSEL_DISP:
				case CHANSEL_DISP:
				default:
					break;
			}
			printf("Key6 Pressed = %2.2f\n", keypad_buffer);
		}

		// BUTTON 9
		if(HAL_GPIO_ReadPin(GPIOE, KP3_GPOUT_Pin))
		{
			switch(mode)
			{
				case PARAMS_DISP:
					_SetKeypadBuffer(_Concatenate(keypad_buffer, 9));
					break;
				case AMPLITUDE_DISP:
					if(DU_IsDualChannelMode())
					{
						if(DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO)
						{
							// 20A is too high for the heatsink
							//DU_SetRampAmplitudeSetting(DAC_CHANNEL_1, DAC_TRIANGLEAMPLITUDE_4095);
							//DU_SetRampAmplitudeSetting(DAC_CHANNEL_2, DAC_TRIANGLEAMPLITUDE_4095);
						}
						else
						{
							// 20A is too high for the heatsink
							//DU_SetRandAmplitudeSetting(DAC_CHANNEL_1, DAC_LFSRUNMASK_BITS11_0);
							//DU_SetRandAmplitudeSetting(DAC_CHANNEL_2, DAC_LFSRUNMASK_BITS11_0);
						}

					}
					else
					{
						if((DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO) || (DU_GetDACModePreview(DAC_CHANNEL_2) == DAC_AUTO))
						{
							// 20A is too high for the heatsink
							//DU_SetRampAmplitudeSetting(DU_GetActiveDACChannel(), DAC_TRIANGLEAMPLITUDE_4095);
						}
						else
						{
							// 20A is too high for the heatsink
							//DU_SetRandAmplitudeSetting(DU_GetActiveDACChannel(), DAC_LFSRUNMASK_BITS11_0);
						}

					}
					break;
				case PROGSEL_DISP:
				case CHANSEL_DISP:
				case HOME_DISP:
				default:
					break;
			}
			printf("Key9 Pressed = %2.2f\n", keypad_buffer);
		}

		// BUTTON #
		if(HAL_GPIO_ReadPin(GPIOE, KP4_GPOUT_Pin))
		{
			// RESET DAC CHANNEL 2
			switch(mode)
			{
				case HOME_DISP:
					DU_ClearVoltagePreview(DAC_CHANNEL_2);
					DU_SetVoltage(DAC_CHANNEL_2);
					DU_ClearFreqPreview(DAC_CHANNEL_2);
					DU_SetFreq(DAC_CHANNEL_2);
					DU_SetDACModeActual(DAC_CHANNEL_2,DAC_USER);

					break;
				case PARAMS_DISP:
				case PROGSEL_DISP:
				case CHANSEL_DISP:
				default:
					break;
			}


			printf("Key # Pressed\n");
		}

