cracked-machine/DigitalCurrentSinkV3/SW/STM32L496_DigitalCurrentSinkV3/Src/InputManager.c
		last_keypad_delay = new_keypad_delay;
	}
}

/**
  * @brief	State-machine for OLED display and menu buttons
  * 		Each button has different action depending on the current state
  *
  * @retval none
  */

void IM_MenuEXTIHandler()
{

	if(HAL_GPIO_ReadPin(GPIOD, Btn1_EXT10_Pin) == GPIO_PIN_RESET)
	{
		// MENU BUTTON 1

		displayState_t theDisplayState = DM_GetState();
		switch(theDisplayState)
		{
			case HOME_DISP:
				DM_ChangeScreen(CHANSEL_DISP);
				break;

			case CHANSEL_DISP:
				DU_SetActiveDACChannel(DAC_CHANNEL_1);
				DU_ToggleDualChannelMode(0);
				DM_ChangeScreen(PROGSEL_DISP);
				break;

			case PROGSEL_DISP:
				// NOTHING
				break;

			case PARAMS_DISP:

				DM_ChangeScreen(AMPLITUDE_DISP);
				break;

			case AMPLITUDE_DISP:
				_ApplyParameterSettings();
				DM_ChangeScreen(HOME_DISP);
				break;

			default:
				break;
		}

	}
	else if(HAL_GPIO_ReadPin(GPIOD, Btn2_EXT11_Pin) == GPIO_PIN_RESET)
	{
		// MENU BUTTON 2
		displayState_t theDisplayState = DM_GetState();
		switch(theDisplayState)
		{
			case HOME_DISP:
				// RESET
				DU_FullReset();
				break;

			case CHANSEL_DISP:
				DU_SetActiveDACChannel(DAC_CHANNEL_2);
				DU_ToggleDualChannelMode(0);
				DM_ChangeScreen(PROGSEL_DISP);
				break;

			case PROGSEL_DISP:
				// NOTHING

				break;

			case PARAMS_DISP:

				DM_ChangeScreen(AMPLITUDE_DISP);
				break;

			case AMPLITUDE_DISP:
				_ApplyParameterSettings();
				DM_ChangeScreen(HOME_DISP);
				break;

			default:
				break;
		}
	}
	else if(HAL_GPIO_ReadPin(GPIOD, Btn3_EXT12_Pin) == GPIO_PIN_RESET)
	{
		// MENU BUTTON 3

		displayState_t theDisplayState = DM_GetState();
		switch(theDisplayState)
		{
			case HOME_DISP:
				if(DU_IsDualChannelMode())
				{
					DU_IncreaseDAC(DAC_CHANNEL_1);
					DU_IncreaseDAC(DAC_CHANNEL_2);
				}
				else
				{
					DU_IncreaseDAC(DU_GetActiveDACChannel());
				}

				break;

			case CHANSEL_DISP:
				DU_ToggleDualChannelMode(1);
				DM_ChangeScreen(PROGSEL_DISP);
				break;

			case PROGSEL_DISP:
				// GO BACK TO PREVIOUS
				DM_ChangeScreen(CHANSEL_DISP);
				break;

			case PARAMS_DISP:
				// CANCEL ALL PREVIEW SETTINGS
				_ClearKeypadBuffer();
				decimal_point_count=0;
				digit_length=1;
				DU_ClearVoltagePreview(DAC_CHANNEL_1);
				DU_ClearVoltagePreview(DAC_CHANNEL_2);
				DU_ClearFreqPreview(DAC_CHANNEL_1);
				DU_ClearFreqPreview(DAC_CHANNEL_2);
				DM_ChangeScreen(PROGSEL_DISP);
				break;

			case AMPLITUDE_DISP:
				// CANCEL ALL PREVIEW SETTINGS
				_ClearKeypadBuffer();
				decimal_point_count=0;
				digit_length=1;
				DU_ClearVoltagePreview(DAC_CHANNEL_1);
				DU_ClearVoltagePreview(DAC_CHANNEL_2);
				DU_ClearFreqPreview(DAC_CHANNEL_1);
				DU_ClearFreqPreview(DAC_CHANNEL_2);
				DM_ChangeScreen(PARAMS_DISP);
				break;

			default:
				break;
		}

	}
else if(HAL_GPIO_ReadPin(GPIOD, Btn4_EXT13_Pin) == GPIO_PIN_RESET)
	{
		// MENU BUTTON 4

		displayState_t theDisplayState = DM_GetState();
		switch(theDisplayState)
		{
			case HOME_DISP:

				if(DU_IsDualChannelMode())
				{
					DU_DecreaseDAC(DAC_CHANNEL_1);
					DU_DecreaseDAC(DAC_CHANNEL_2);
				}
				else
				{
					DU_DecreaseDAC(DU_GetActiveDACChannel());
				}

				break;

			case CHANSEL_DISP:
				DM_ChangeScreen(HOME_DISP);
				break;

			case PROGSEL_DISP:
				DM_ChangeScreen(HOME_DISP);
				break;

			case PARAMS_DISP:
				// CANCEL ALL PREVIEW SETTINGS
				_ClearKeypadBuffer();
				DU_ClearVoltagePreview(DAC_CHANNEL_1);
				DU_ClearVoltagePreview(DAC_CHANNEL_2);
				DU_ClearFreqPreview(DAC_CHANNEL_1);
				DU_ClearFreqPreview(DAC_CHANNEL_2);
				DM_ChangeScreen(HOME_DISP);
				break;

			case AMPLITUDE_DISP:
				// CANCEL ALL PREVIEW SETTINGS
				_ClearKeypadBuffer();
				DU_ClearVoltagePreview(DAC_CHANNEL_1);
				DU_ClearVoltagePreview(DAC_CHANNEL_2);
				DU_ClearFreqPreview(DAC_CHANNEL_1);
				DU_ClearFreqPreview(DAC_CHANNEL_2);
				DM_ChangeScreen(HOME_DISP);
				break;

			default:
				break;

		}
	}

}

/**
  * @brief Apply the preview settings set by user
  *
  *
  * @retval none
  */

void _ApplyParameterSettings()
{
	// apply voltage/freq values to actual register
	if(DU_GetDACModePreview(DU_GetActiveDACChannel()) == DAC_USER)
	{
		if(DU_IsDualChannelMode())
		{
			DU_SetVoltage(DAC_CHANNEL_1);
			DU_SetVoltage(DAC_CHANNEL_2);
		}
		else
		{
			DU_SetVoltage(DU_GetActiveDACChannel());
		}
	}
	if(DU_GetDACModePreview(DU_GetActiveDACChannel()) != DAC_USER)
	{
		if(DU_IsDualChannelMode())
		{
			DU_SetFreq(DAC_CHANNEL_1);
			DU_SetFreq(DAC_CHANNEL_2);
		}
		else
		{
			DU_SetFreq(DU_GetActiveDACChannel());
		}
	}


	// Apply DAC Mode preview to actual DAC mode register
	if(DU_IsDualChannelMode())
	{
		DU_SetDualDACModeActual(DU_GetDACModePreview(DAC_CHANNEL_1));
	}
	else
	{
		DU_SetDACModeActual(DU_GetActiveDACChannel(), DU_GetDACModePreview(DU_GetActiveDACChannel()));
	}


	_ClearKeypadBuffer();
	decimal_point_count=0;			// reset the decimal point counter
	digit_length=1;
}

/**
  * @brief get keypad_debounce_counter
  *
  *
  * @param
  * 		@arg @ref
  * @param
  * 		@arg @ref
  *
  *
  * @retval keypad_debounce_counter
  */

uint32_t _GetKeypadDebounceCounter()
{
	return keypad_debounce_counter;
}

/**
  * @brief Update the buffer and set the voltage/frequency preview variable
  *
  *
  * @param value The new value to update
  *
  * @retval none
  */

void _SetKeypadBuffer(double pValue)
{

		keypad_buffer = pValue;
		if(DU_IsDualChannelMode())
		{
			if(DU_GetDACModePreview(DU_GetActiveDACChannel()) == DAC_USER)
			{
				// 3 AMPS HARD LIMIT!
				if (keypad_buffer > 3)
				{
					keypad_buffer = 0;
					decimal_point_count = 0;
					// TODO Add warning to bottom screen
				}
				// user has entered a new Amperage value, convert to DAC output voltage
				float new_dac_voltage = DU_CalcVoltageFromOhmsLaw(DAC_CHANNEL_1, (float)keypad_buffer);
				DU_SetVoltagePreview(DAC_CHANNEL_1, new_dac_voltage);

				new_dac_voltage = DU_CalcVoltageFromOhmsLaw(DAC_CHANNEL_2, (float)keypad_buffer);
				DU_SetVoltagePreview(DAC_CHANNEL_2, new_dac_voltage);

