cracked-machine/DigitalCurrentSinkV3/SW/STM32L496_DigitalCurrentSinkV3/Src/InputManager.c
			}
			if(DU_GetDACModePreview(DU_GetActiveDACChannel()) != DAC_USER)
			{

				DU_SetFreqPreview(DAC_CHANNEL_1, (float)keypad_buffer);
				DU_SetFreqPreview(DAC_CHANNEL_2, (float)keypad_buffer);
			}

		}
		else
		{
			if(DU_GetDACModePreview(DU_GetActiveDACChannel()) == DAC_USER)
			{
				// 3 AMPS HARD LIMIT!
				if (keypad_buffer > 3)
				{
					keypad_buffer = 0;
					decimal_point_count = 0;
					// TODO Add warning to bottom screen
				}
				// user has entered a new Amperage value, convert to DAC output voltage
				float newCurrent = DU_CalcVoltageFromOhmsLaw(DU_GetActiveDACChannel(), (float)keypad_buffer);
				DU_SetVoltagePreview(DU_GetActiveDACChannel(), newCurrent);
			}

			if(DU_GetDACModePreview(DU_GetActiveDACChannel()) != DAC_USER)
			{
				DU_SetFreqPreview(DU_GetActiveDACChannel(), (float)keypad_buffer);
			}

		}


}

/**
  * @brief Zero the keypad_buffer
  *
  *
  * @retval none
  */

void _ClearKeypadBuffer()
{
	keypad_buffer = 0;
}

/**
  * @brief	Process integer or fractional positioning for appending new digit to keypad_buffer.
  * 		Integer parts: 		_buffer * exp + _newDigit
  *			Fractional parts:	_buffer + ( _newDigit / ( pow( exp,decimal_point_count ) )
  *
  * @param	_buffer The existing keypad buffer contents
  * @param	_newDigit The new digit to add to the keypad buffer
  *
  * @retval The new keypad buffer value
  */

double _Concatenate(double _buffer, double _newDigit)
{
	double next_calculated_value = 0;
    double exp = 10;
    if(decimal_point_count > 0)
    {


    	_newDigit = _newDigit / (pow(exp,decimal_point_count));
    	decimal_point_count++;
    	printf("Increment DP Count: %d\n", decimal_point_count);
    	next_calculated_value = (_buffer + _newDigit);
    	digit_length++;
    }
    else
    {
    	next_calculated_value = (_buffer * exp + _newDigit);
    }

    if(next_calculated_value >= keypadBufferMax)
    {
    	_SetKeypadBuffer(_buffer);						// set display using previous entered value
    	return 0;
    }

    return next_calculated_value;
}
